{"id":103979,"xmlId":"org.sonarlint.idea","name":"SonarLint","description":"\n        \n            <p>\n                SonarLint is a free IDE extension that lets you fix bugs and vulnerabilities as you write code!\n                Like a spell checker, SonarLint highlights coding issues on the fly, with clear remediation\n                guidance so you can fix them before the code is even committed. Across popular IDEs (Eclipse,\n                IntelliJ, Visual Studio, VS Code) and popular programming languages, SonarLint helps all developers\n                write better and safer code!\n            </p>\n            <br>\n            <p>\n                SonarLint supports all JetBrains IDE, including IntelliJ, WebStorm, PhpStorm, PyCharm and RubyMine.\n                It can analyze code written in Java, JavaScript, TypeScript, Python, Kotlin, Ruby, HTML &amp; PHP.\n            </p>\n            <br>\n            <p>\n                If your project is analyzed on SonarQube or on SonarCloud, SonarLint can connect to \n                the server to retrieve the appropriate quality profiles and settings for that project. Java 8 \n                is required to run SonarLint; analysis of JavaScript and TypeScript requires Node.js &gt;= 8.\n            </p>\n        \n      ","tags":["Security","Code Quality","Static Analysis"],"vendor":"SonarSource","version":"4.13.0.24781","notes":"\n      <ul>\n        <li>4.13 - New or improved rules for access control or authentication in Java. Security rules for JS/TS. Support of PHP 8, improved rules. Updated Kotlin and Ruby analyzers, supporting latest language features and improved rules. Updated HTML analyzer with improved rules. Reworked server notifications. Review a Security Hotspot within its context.</li>\n        <li>4.12 - Lots of new rules for Java (including test code), support analysis of Java 14. 20 new rules for PHP, including 13 related to unit tests. 2 new rules for JavaScript. 3 new rules for Python. Bug fixes and improvements.</li>\n        <li>4.11 - Improve issues, flows and secondary locations navigation and highlighting. Show secondary location indexes in the editor. Add 'Show rule description' and 'Show data flow/issue locations' contextual actions. Relax search criteria in rule configuration filter. Show effective rule parameter in the rule description panel. Bug fixes and improvements.</li>\n        <li>4.10 - Fix duplicated annotations for PHP files. Display rule severity defined in the quality profile in connected mode. Fix analysis failure with JSP files. Bug fixes and improvements for JS files. 4 new rules (3 security related), bug fixes and improvements for PHP files.</li>\n        <li>4.9 - Many new rules about JUnit and AssertJ for Java test files. 10 new rules for PHP. 22 new rules for Python and support of Typeshed packages. Preparatory changes for dynamic plugin installation.</li>\n        <li>4.8 - Configure rule parameters in IDE settings. Performance improvement and fewer false positives for PHP. 4 new vulnerability detection rules for Python.</li>\n        <li>4.7 - 2 new rules and performance improvements for Java. 2 new rules for Python.</li>\n        <li>4.6 - Enable analysis of TypeScript. 27 new rules for Python. Support for Python 3.8.</li>\n        <li>4.5.1 - Fix two regressions causing exception during analysis.</li>\n        <li>4.5 - 3 new rules and engine improvements for Python. New engine for Java, with support for Java 13 preview features.</li>\n        <li>4.4 - Ensure compatibility with JetBrains 2020.x release train. 22 new rules and engine improvements for Python. Support for PHP 7.4. New engine for JavaScript, 8 new rules.</li>\n        <li>4.3 - Supports SonarJS 6.x in connected mode. Updated issue type icons.</li>\n        <li>4.2 - Analyze HTML in Vue.js single file components. 8 new HTML rules. Support 'Ignore Issues on Files' and 'Ignore Issues in Blocks' in connected mode.</li>\n        <li>4.1.1 - Fix regression on quality profile in connected mode</li>\n        <li>4.1 - Enable analysis of HTML. Add support of XML in connected mode. 10 new Java rules.</li>\n        <li>4.0.2 - Fix error on startup registering actions affecting all IDEs other than IntelliJ</li>\n        <li>4.0.1 - Fix duplicated highlighting in WebStorm and connection to a server with more than 10k rules</li>\n        <li>4.0 - Improved matching of issues with SonarQube</li>\n        <li>3.5.1 - Fixed error with read access and repeated annotations</li>\n        <li>3.5 - Manage rules when not connected to SonarQube or SonarCloud</li>\n        <li>3.4.2 - Fix a regression in the SonarQube server configuration wizard</li>\n        <li>3.4.1 - Fix of several bugs: binding to SonarCloud organizations, support of Java 10, rendering of rule descriptions</li>\n        <li>3.4 - Update of embedded code analyzers. Fix analysis of files located outside of the project base directory</li>\n        <li>3.3 - Numerous improvements and UX enhancements.</li>\n        <li>3.2.1 - Bug fix for concurrent modification when all files of a module are excluded by server configuration</li>\n        <li>3.2 - Support excluding files from the automatic analysis</li>\n        <li>3.1 - Various minor improvements and bug fixes. Updated code analyzers.</li>\n        <li>3.0 - Avoid saving files when possible. Improve support of cancellation</li>\n        <li>2.10 - Support of SonarQube organizations</li>\n        <li>2.9 - New code analyzers included in standalone mode. Collection of usage statistics</li>\n        <li>2.8 - Analyze all files in project. New icons for issue types</li>\n        <li>2.7 - Display of secondary locations of issues</li>\n        <li>2.6 - Support of SSL certificates configured in IntelliJ</li>\n        <li>2.5 - Analysis of VCS changed files and notifications about binding update</li>\n        <li>2.4.3 - Bug fix for multi-module projects on Windows</li>\n        <li>2.4.2 - Fix resolved issues on windows and authentication</li>\n        <li>2.4.1 - Bug fix of Javascript in standalone mode.</li>\n        <li>2.4 - Hide issues that are resolved in SonarQube. Numerous bug fixes.</li>\n        <li>2.3.2 - Fix configuration of automatic trigger of analysis</li>\n        <li>2.3.1 - Bug fix for analysis configuration and performance improvements</li>\n        <li>2.3 - Support of exclusions in connected mode; Numerous bug fixes. Java 8 is now required to run SonarLint.</li>\n        <li>2.2 - Support of SonarQube LTS (4.5) and commercial plugins</li>\n        <li>2.1.1 - Bug fix for PHPStorm</li>\n        <li>2.1 - Various improvements and bug fixes</li>\n        <li>2.0.2 - Bug fix SLI-73</li>\n        <li>2.0.1 - Bug fixes</li>\n        <li>2.0 - Connect to a SonarQube server;</li>\n        <li>1.5 - Display SonarLint markers age;</li>\n        <li>1.4 - No internet required; Several bug fixes;</li>\n        <li>1.3 - Issues views; UI improvements;</li>\n        <li>1.2 - Automatic trigger of analysis; \"NO SONAR\" quick fix; configurable highlighting of issues;</li>\n        <li>1.1 - More precise issue location; trigger of analysis changed to on demand only; improved SonarLint console;</li>\n        <li>1.0 - On the fly SonarLint inspection</li>\n      </ul>\n      \n    ","dependencies":["com.intellij.modules.lang"],"optionalDependencies":["com.intellij.modules.java"],"since":"183.4588.3","sourceCodeUrl":"https://github.com/SonarSource/sonarlint-intellij","size":80697882,"url":"https://www.sonarlint.org"}